In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1={
    "name":['alfard','harry','joy','dev'],
    "marks":[45,87,67,74],
    "city":['mumbai','goa','pune','nagpur']
}

In [4]:
df=pd.DataFrame(dict1)

In [5]:
df

     name  marks    city
0  alfard     45  mumbai
1   harry     87     goa
2     joy     67    pune
3     dev     74  nagpur

In [6]:
#Export this df into csv
df.to_csv('firends.csv')

In [7]:
df.to_csv('friends_index_false.csv',index=False)

In [8]:
df.head(2)

     name  marks    city
0  alfard     45  mumbai
1   harry     87     goa

In [9]:
df.tail(2)

  name  marks    city
2  joy     67    pune
3  dev     74  nagpur

In [10]:
df.describe()

           marks
count   4.000000
mean   68.250000
std    17.576025
min    45.000000
25%    61.500000
50%    70.500000
75%    77.250000
max    87.000000

In [20]:
train=pd.read_csv('traindata.csv')

In [21]:
train

   Train_num  marks    city
0      12345    145  mumbai
1      54232     87     goa
2      87536    167    pune
3     816263    174  nagpur

In [22]:
train['marks']

0    145
1     87
2    167
3    174
Name: marks, dtype: int64

In [23]:
train['marks'][0]

145

In [24]:
train['marks'][0]=200

C:\Users\admin\AppData\Local\Temp\ipykernel_19304\1551401031.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['marks'][0]=200

In [25]:
train

   Train_num  marks    city
0      12345    200  mumbai
1      54232     87     goa
2      87536    167    pune
3     816263    174  nagpur

In [18]:
train

   Train_num  marks    city
0      12345  speed  mumbai
1      54232  speed     goa
2      87536  speed    pune
3     816263  speed  nagpur

In [26]:
train.index=['first','second','third','fourth']

In [27]:
train

        Train_num  marks    city
first       12345    200  mumbai
second      54232     87     goa
third       87536    167    pune
fourth     816263    174  nagpur

In [28]:
ser=pd.Series(np.random.rand(34))

In [29]:
ser

0     0.096578
1     0.788398
2     0.162015
3     0.521384
4     0.878087
5     0.361953
6     0.429991
7     0.656435
8     0.697006
9     0.380506
10    0.822237
11    0.085840
12    0.794416
13    0.763817
14    0.675022
15    0.429932
16    0.586221
17    0.841694
18    0.029549
19    0.401493
20    0.609617
21    0.399525
22    0.809123
23    0.450827
24    0.352479
25    0.355389
26    0.063628
27    0.431787
28    0.621966
29    0.857011
30    0.156809
31    0.617762
32    0.355646
33    0.091194
dtype: float64

In [33]:
newdf=pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [34]:
newdf

            0         1         2         3         4
0    0.875780  0.681043  0.077370  0.217119  0.879472
1    0.538218  0.401338  0.684706  0.239587  0.867082
2    0.977158  0.792263  0.235854  0.549123  0.455880
3    0.345512  0.121771  0.833297  0.351606  0.396322
4    0.833658  0.487959  0.206917  0.521030  0.930395
..        ...       ...       ...       ...       ...
329  0.957232  0.015802  0.816639  0.599904  0.528463
330  0.824367  0.658618  0.035443  0.818910  0.599796
331  0.383037  0.004440  0.259044  0.224504  0.567675
332  0.013682  0.714275  0.749843  0.597944  0.234579
333  0.444926  0.316478  0.639061  0.834419  0.682039

[334 rows x 5 columns]

In [35]:
type(newdf)

pandas.core.frame.DataFrame

In [36]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.500976    0.474515    0.505269    0.525182    0.514445
std      0.290396    0.296891    0.294341    0.284687    0.279960
min      0.002114    0.000830    0.000057    0.000209    0.005434
25%      0.249139    0.217908    0.259648    0.286262    0.273067
50%      0.499857    0.461149    0.501535    0.531359    0.531846
75%      0.762483    0.726388    0.765521    0.788147    0.752235
max      0.994625    0.998327    0.991809    0.997929    0.993982

In [37]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [38]:
newdf.head()

          0         1         2         3         4
0  0.875780  0.681043  0.077370  0.217119  0.879472
1  0.538218  0.401338  0.684706  0.239587  0.867082
2  0.977158  0.792263  0.235854  0.549123  0.455880
3  0.345512  0.121771  0.833297  0.351606  0.396322
4  0.833658  0.487959  0.206917  0.521030  0.930395

In [39]:
newdf[0][0]="pandas"

In [40]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [41]:
newdf.head()

          0         1         2         3         4
0    pandas  0.681043  0.077370  0.217119  0.879472
1  0.538218  0.401338  0.684706  0.239587  0.867082
2  0.977158  0.792263  0.235854  0.549123  0.455880
3  0.345512  0.121771  0.833297  0.351606  0.396322
4  0.833658  0.487959  0.206917  0.521030  0.930395

In [42]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [43]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [44]:
newdf.to_numpy()

array([['pandas', 0.6810430030016174, 0.07736958894828405,
        0.2171193888633195, 0.8794723459745064],
       [0.538218481625381, 0.40133826452209576, 0.6847057474961206,
        0.23958679027652907, 0.8670819133443918],
       [0.9771579945821929, 0.7922633600948387, 0.23585390071494206,
        0.5491232565932517, 0.4558800967539628],
       ...,
       [0.3830372585738179, 0.0044399167802468, 0.25904392687252364,
        0.22450431603149212, 0.567675100789033],
       [0.013681642608436961, 0.7142751784813801, 0.7498434288869888,
        0.5979443278592865, 0.23457937172232202],
       [0.4449260626785264, 0.3164780033904381, 0.6390613817207609,
        0.8344193770263868, 0.6820385801668527]], dtype=object)

In [45]:
newdf[0][0]=0.3735

In [46]:
newdf.head()

          0         1         2         3         4
0    0.3735  0.681043  0.077370  0.217119  0.879472
1  0.538218  0.401338  0.684706  0.239587  0.867082
2  0.977158  0.792263  0.235854  0.549123  0.455880
3  0.345512  0.121771  0.833297  0.351606  0.396322
4  0.833658  0.487959  0.206917  0.521030  0.930395

In [47]:
newdf.T
# T=Transpose convert row to col vice versa

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3735,0.538218,0.977158,0.345512,0.833658,0.838042,0.736631,0.685411,0.833038,0.152389,...,0.835756,0.05995,0.533651,0.688387,0.815384,0.957232,0.824367,0.383037,0.013682,0.444926
1,0.681043,0.401338,0.792263,0.121771,0.487959,0.262715,0.446316,0.948574,0.872449,0.003736,...,0.247993,0.637602,0.598445,0.640897,0.480632,0.015802,0.658618,0.00444,0.714275,0.316478
2,0.07737,0.684706,0.235854,0.833297,0.206917,0.961261,0.063472,0.9464,0.272753,0.007587,...,0.83479,0.62444,0.383318,0.580402,0.271525,0.816639,0.035443,0.259044,0.749843,0.639061
3,0.217119,0.239587,0.549123,0.351606,0.52103,0.84669,0.567069,0.295144,0.594218,0.743662,...,0.282117,0.589578,0.86059,0.050454,0.90648,0.599904,0.81891,0.224504,0.597944,0.834419
4,0.879472,0.867082,0.45588,0.396322,0.930395,0.759549,0.548881,0.350549,0.45918,0.039088,...,0.117224,0.779616,0.514577,0.618373,0.195018,0.528463,0.599796,0.567675,0.234579,0.682039

In [48]:
newdf.sort_index(axis=0,ascending=False)  #axis=0 for row

            0         1         2         3         4
333  0.444926  0.316478  0.639061  0.834419  0.682039
332  0.013682  0.714275  0.749843  0.597944  0.234579
331  0.383037  0.004440  0.259044  0.224504  0.567675
330  0.824367  0.658618  0.035443  0.818910  0.599796
329  0.957232  0.015802  0.816639  0.599904  0.528463
..        ...       ...       ...       ...       ...
4    0.833658  0.487959  0.206917  0.521030  0.930395
3    0.345512  0.121771  0.833297  0.351606  0.396322
2    0.977158  0.792263  0.235854  0.549123  0.455880
1    0.538218  0.401338  0.684706  0.239587  0.867082
0      0.3735  0.681043  0.077370  0.217119  0.879472

[334 rows x 5 columns]

In [49]:
newdf.sort_index(axis=1,ascending=False)   #axis=1 for col

            4         3         2         1         0
0    0.879472  0.217119  0.077370  0.681043    0.3735
1    0.867082  0.239587  0.684706  0.401338  0.538218
2    0.455880  0.549123  0.235854  0.792263  0.977158
3    0.396322  0.351606  0.833297  0.121771  0.345512
4    0.930395  0.521030  0.206917  0.487959  0.833658
..        ...       ...       ...       ...       ...
329  0.528463  0.599904  0.816639  0.015802  0.957232
330  0.599796  0.818910  0.035443  0.658618  0.824367
331  0.567675  0.224504  0.259044  0.004440  0.383037
332  0.234579  0.597944  0.749843  0.714275  0.013682
333  0.682039  0.834419  0.639061  0.316478  0.444926

[334 rows x 5 columns]